{
  "personal": {
    "objective": "Work in a game studio as programmer.",
    "summary": "I'm a programmer since 2010. Along those many years learned many programming languages, technics and programs. Viewing my history, I can say I'm a person who can learn fast, care to do it well and try to improve the team and the project.",
    "bio": "I was born in 1992, Porto Alegre, Brazil. I was 7 year old when I started to use computer. Playing games was my main activity years later, making me want to work with it. At first step, I learned how to program and, not much time before, I started to work. Years later my will to work in the game industry came back, so I stopped everything I downloaded Unity. After a finished my Post-Graduation in Digital Games, I joined in the game industry, as I wished.",
    "otherSkills": "Some extra information about what I do/know. I can play many instruments (guitar, bass, drums and keyboard) and compose musics. I can edit videos (using Sony Vegas as preference) using technics and designs patters. In my Post-Graduation, I learned how to model and animate in 3D (using Blender), but I'm rusty a bit now."
  },
  "education": [
    {
      "level": "Specialization",
      "courses": [
        {
          "description": "Development of Digital Games - Programming and Game Designer",
          "period": "2015-2016/2",
          "school": "PUCRS",
          "place": "Porto Alegre\\BR"
        }
      ]
    },
    {
      "level": "Bachelor's Degree",
      "courses": [
        {
          "description": "Computer Science",
          "period": "2009-2014",
          "school": "Unilasalle",
          "place": "Canoas\\BR"
        }
      ]
    },
    {
      "level": "Extracurricular",
      "courses": [
        {
          "description": "Students to Business",
          "period": "2013",
          "school": "PUCRS",
          "place": "Porto Alegre\\BR"
        },
        {
          "description": "Arduino Advanced",
          "period": "2013",
          "school": "Unilasalle",
          "place": "Canoas\\BR"
        },
        {
          "description": "Arduino Basic",
          "period": "2012",
          "school": "Unilasalle",
          "place": "Canoas\\BR"
        },
        {
          "description": "Programming in C for microprocessors",
          "period": "2011",
          "school": "Unilasalle",
          "place": "Canoas\\BR"
        },
        {
          "description": "English Course",
          "period": "2005-2009",
          "school": "Challenge Idioms Center",
          "place": "Canoas\\BR"
        }
      ]
    }
  ],
  "professional": [
    {
      "name": "Símix Sistemas",
      "date": "Dec 2019",
      "place": "Canoas\\BR",
      "description": "Indoor media software for supermarkets."
    },
    {
      "name": "iProcess",
      "date": "Oct 2019 – Dec 2019 (3 mos)",
      "place": "Porto Alegre\\BR",
      "description": "Process and human job automation using Automation Anywhere RPA software."
    },
    {
      "name": "Rockhead Games",
      "date": "Nov 2016 – Oct 2019 (3 yrs)",
      "place": "Porto Alegre\\BR",
      "description": "I worked as programmer in Stalirt OnWheels since the beginning  (see the game page for more details). Port for Starlit Adventures for an arcade machine, Xbox One and Nintendo Switch. I also helped in the end of the Starlit Archery project in the end of the project."
    },
    {
      "name": "Autonomous Development",
      "date": "Oct 2015 - Dec 2015 (3 mos)",
      "place": "Canoas\\BR",
      "description": "Android/IOS game for a kid toy. My classmate brought the project to create a program that will enhance the experience of the toy. This program allows to take photos and import them to virtual cube. For each faces there will be a game using the animal sprite as the player. If the face associated with the animal has a photo taken, it will be used as the animal sprite texture in game."
    },
    {
      "name": "Autonomous Development",
      "date": "(Jan - Feb 2014)(Jan - Feb 2015) (2 mos",
      "place": "Canoas\\BR",
      "description": "PHP system to store plant photos and data for academic purposes. It is like a gallery to expose the information collected in the other system with photos. Using MVC, Bootstrap, Jquery and MySql."
    },
    {
      "name": "DBServer ",
      "date": "Feb 2014 - Nov 2014 (10 mos)",
      "place": "Porto Alegre\\BR",
      "description": "I've got this job after a good presentation in Students to Business. I've participated in three different projects, all in C# and SQL Server. Two were maintenance. The last was from beginning. The system was about material test control with laboratories and budget managements. The client was a government organ and they participate in meetings with my team after each Scrum sprint. In November I decided to stop working in web systems and start studying to work with programming games."
    },
    {
      "name": "Unilasalle",
      "date": "Jul 2009 - Nov 2013 (4 yrs 5 mos)",
      "place": "Canoas\\BR",
      "description": "I started as a probationer and finished as a middle programmer. I was learning the theoretical part of computation at university and the practice in this job. My job was to create programs for the internal administrative system, student portal and professor portal. The language and database was PHP and Oracle g10. Sometimes I converted old programs from the old system in VB Desktop to the new in PHP. In the last year on the job, I started going to meetings with department leaders to define future programs."
    }
  ],
  "skillSections": [
    {
      "name": "Languages",
      "skills": [
        {
          "name": "C/C++",
          "level": 4
        },
        {
          "name": "C#",
          "level": 5
        },
        {
          "name": "HTML",
          "level": 5
        },
        {
          "name": "Java",
          "level": 3
        },
        {
          "name": "Javascript",
          "level": 5
        },
        {
          "name": "Kotin",
          "level": 3
        },
        {
          "name": "PHP",
          "level": 5
        },
        {
          "name": "Python",
          "level": 4
        },
        {
          "name": "Visual Baisc",
          "level": 3
        }
      ]
    },

    {
      "name": "Programs",
      "skills": [
        {
          "name": "Arduino",
          "level": 3
        },
        {
          "name": "Audacity",
          "level": 4
        },
        {
          "name": "Automation Anywhere",
          "level": 4
        },
        {
          "name": "Blender",
          "level": 4
        },
        {
          "name": "Docker",
          "level": 4
        },
        {
          "name": "Photoshop",
          "level": 3
        },
        {
          "name": "Gimp",
          "level": 3
        },
        {
          "name": "Sony Vegas",
          "level": 4
        },
        {
          "name": "UI Path",
          "level": 3
        },
        {
          "name": "Unity",
          "level": 5
        }
      ]
    },

    {
      "name": "Version Control",
      "skills": [
        {
          "name": "SVN",
          "level": 4
        },
        {
          "name": "GIT",
          "level": 4
        },
        {
          "name": "Trac",
          "level": 5
        },
        {
          "name": "GitHub",
          "level": 4
        },
        {
          "name": "GitLab",
          "level": 4
        }
      ]
    },

    {
      "name": "Databases",
      "skills": [
        {
          "name": "MySql",
          "level": 4
        },
        {
          "name": "MongoDB",
          "level": 4
        },
        {
          "name": "Oracle",
          "level": 4
        },
        {
          "name": "SqlServer",
          "level": 3
        }
      ]
    }
  ],

  "softwares": [
    {
      "name": "Elevator Builder",
      "summary": "3D software that makes possible to customize elevators. Its is a showcase to demonstrate what I can do using Unity (or other development tool) to create tool to customize products. It could be done with cars, planes and others objects.",
      "date": "June 2021",
      "localPage": "",
      "externalPage": "https://bittarello.itch.io/elevator-builder",
      "platforms": [ { "name": "Web" } ],
      "icon": "img/portfolio/elevatorBuilderIcon.png",
      "image": "img/portfolio/elevatorBuilderScreen.png"
    },
    {
      "name": "Marvel Character Information",
      "summary": "Android application lists Marvel characters and some information.",
      "date": "June 2019",
      "localPage": "",
      "externalPage": "https://github.com/brunobittarello/MarvelCharacterInfo",
      "platforms": [ { "name": "Android" } ],
      "icon": "img/portfolio/marvelChar-icon.png",
      "image": "https://raw.githubusercontent.com/brunobittarello/MarvelCharacterInfo/main/Media/marvel-mobile-video.gif"
    }
  ],

  "games": [
    {
      "name": "Escape From Student Debt",
      "summary": "Puzzle game created during #PQJam21. You must help the protagonist pass all rooms after entering in a strange door, with a promisse of an usefull certification in the end.",
      "date": "May 2021",
      "localPage": "",
      "externalPage": "https://bittarello.itch.io/escape-from-student-debt",
      "platforms": [
        {
          "name": "Web"
        },
        {
          "name": "Desktop"
        }
      ],
      "icon": "img/portfolio/escapeFromStudentDebtIcon.png",
      "image": "img/portfolio/escapeFromStudentDebtBanner.png"
    },
    {
      "name": "Starlit On Wheels: Super Kart",
      "summary": "Welcome to the ride of your life with the heroes from Starlit Adventures: Bo and Kikki! Help Bo and Kikki on a thrilling chase to recover the stars that the villain Nuru has stolen to power his magical motor. During this exciting journey you'll confront breathtaking tracks and obstacles, and be challenged by enemies and creatures from the Starlit universe in championships full of fun and adventure. Along the way, you'll drive remarkable cars with special powers. While you enjoy this journey to save your friends, you'll upgrade your cars, collect rewards, assemble a trophy room and create your own tracks that other players can race and evaluate!",
      "date": "November 2018",
      "localPage": "",
      "externalPage": "",
      "platforms": [
        {
          "name": "Iphone",
          "link": "https://apps.apple.com/us/app/starlit-on-wheels-super-kart/id1352078840"
        },
        {
          "name": "Android",
          "link": "https://play.google.com/store/apps/details?id=com.rockhead.starlit.onwheels"
        }
      ],
      "icon": "img/portfolio/starlitOnWheelsIcon.jpg",
      "image": "img/portfolio/starlitOnWheels.png"
    },
    {
      "name": "Starlit Archery Club",
      "summary": "Become the greatest Archer in Starlit universe! Play with your favorite characters and enjoy the story-line from the universe introduced in the award-winning game Starlit Adventures!",
      "date": "September 2017",
      "localPage": "",
      "externalPage": "",
      "platforms": [
        {
          "name": "Iphone",
          "link": "https://apps.apple.com/us/app/starlit-adventures/id1135100050"
        },
        {
          "name": "Android",
          "link": "https://play.google.com/store/apps/details?id=com.rockhead.starlit.archery"
        }
      ],
      "icon": "img/portfolio/starlitAcheryIcon.jpg",
      "image": "img/portfolio/starlitAcheryIcon.jpg"
    },
    {
      "name": "Pac-Man",
      "summary": "The classic arcade game!",
      "date": " January  2019",
      "localPage": "pacman",
      "externalPage": "",
      "platforms": [
        {
          "name": "Windows",
          "link": "https://drive.google.com/file/d/1m6FbE1eA3Rwr2lYvaXDEjRmUByRCRdPF/view"
        }
      ],
      "icon": "img/portfolio/pacman2.png",
      "image": "img/portfolio/pacman.png",

      "description": [
        "Pac-Man is a maze chase video game. The player controls the titular character through an enclosed maze; the objective of the game is to eat all of the dots placed in the maze while avoiding four colored ghosts — Blinky (red), Pinky (pink), Inky (cyan), and Clyde (orange) — that pursue him. When all of the dots are eaten, the player advances to the next level. If Pac-Man makes contact with a ghost, he will lose a life; the game ends when all lives are lost. Each of the four ghosts have their own unique, distinct artificial intelligence (A.I.), or \"personalities\"; Blinky gives direct chase to Pac-Man, Pinky and Inky try to position themselves in front of Pac-Man, usually by cornering him, and Clyde will switch between chasing Pac-Man and fleeing from him",
        "Placed at the four corners of the maze are large flashing \"energizers\", or \"power pellets\". Eating these will cause the ghosts to turn blue with a dizzied expression and reverse direction. Pac-Man can eat blue ghosts for bonus points; when eaten, their eyes make their way back to the center box in the maze. Eating multiple blue ghosts in succession increases their point value. Blue-colored ghosts will flash white when they are about to turn back into their normal, lethal form. Eating a certain number of dots in a level will cause a bonus item, usually in the form of a fruit, to appear underneath the regeneration box, which can be eaten for bonus points.",
        "The game increases in difficulty as the player progresses; the ghosts become faster and the power pellets decrease in length, to the point where the ghosts will no longer turn blue and edible. To the sides of the maze are two large \"warp tunnels\", which allow Pac-Man and the ghosts to travel to the opposite side of the screen. Ghosts become slower when entering and exiting these tunnels. Levels are indicated by the fruit icon at the bottom of the screen. In-between levels are short cutscenes featuring Pac-Man and Blinky in humorous, comical situations. The game becomes unplayable at the 256th level due to an integer overflow that affects the game's memory, rendering this level unbeatable. <a style=\"color: darkblue\" href=\"https://en.wikipedia.org/wiki/Pac-Man\">[Wiki]</a>"
      ],
      "details": {
        "genres": [ "Arcade" ],
        "localPlayerTotal": 1,
        "onlinePlayerTotal": 0,
        "lastUpdated": "30-Jan-2019"
      },
      "production": {
        "motivation": "Remake created as a test in a game studio. They gave me one week to do and this is what I created in my spare time.",
        "history": [
          {
            "name": "0.1.0 – Stable",
            "date": "30-Jan-2019",
            "objective": "Main gameplay working correctly."
          }
        ]
      },
      "media": {
        "screenshots": [
          {
            "title": "",
            "description": "",
            "link": "img/portfolio/pacman/gameplay.png"
          }
        ],
        "videos": [
          "https://www.youtube.com/embed/uxoW6VE1Oak"
        ]
      }
    },
    {
      "name": "The Magic Tower",
      "summary": "Wizards with the ability to conjure elements to cast powers will fight against waves of monsters inside the tower. Sometimes, they brawl with each other to decide who is the best caster.",
      "date": "November 2016",
      "localPage": "tower",
      "externalPage": "",
      "platforms": [
        {
          "name": "Windows",
          "link": ""
        }
      ],
      "icon": "img/portfolio/TheMagicTower16x9.png",
      "image": "img/portfolio/TheMagicTower16x9.png",

      "description": [
        "Wizards with the ability to conjure elements to cast powers will fight against waves of monsters inside the tower. Sometimes, they brawl with each other to decide who is the best caster.",
        "Combining elements, like fire with water to use steam, the player can craft power to destroy its target. Adding fire to any power will cause burning in any creature hit, including the wizard whom cast it."
      ],
      "details": {
        "genres": [ "Brawl", "2D arena" ],
        "localPlayerTotal": 2,
        "onlinePlayerTotal": 2,
        "lastUpdated": "24-Nov-2016"
      },
      "production": {
        "motivation": "I've imagined who cool it would be if Magicka mixed with TowerFall Ascention. The creation process was different than any other I've already experienced. I have to mix two solid and stable games in one without know if it would be fun as well. As the project was going further, I saw some future on it. The current state doesn't have a lot of magics and combinations, but already demonstrate a good gameplay. Creating all the art and animation, like in Sprawl Celerity, make the project much harder. I'm growing up in this area but with a cost of patience and time.",
        "remarks": [
          "Unet (Unity Network);",
          "Custom Shader;",
          "Tiled integration;",
          "All 3D objects created by me (except the goblin enemy, created by Matheus);",
          "Personal Framework;"
        ],
        "history": [
          {
            "name": "0.0.1 – Prototype",
            "date": "03-Set-2016",
            "objective": "Test main features and inputs to use."
          },
          {
            "name": "0.0.2 – Enemies",
            "date": "24-Nov-2016",
            "objective": "Coop and versus working."
          }
        ]
      },
      "media": {
        "screenshots": [
          {
            "title": "Main menu",
            "description": "",
            "link": "img/portfolio/tower/menu.png"
          },
          {
            "title": "Gameplay",
            "description": "",
            "link": "img/portfolio/tower/gameplay1.png"
          },
          {
            "title": "Tutorial",
            "description": "",
            "link": "img/portfolio/tower/tutorial.png"
          },
          {
            "title": "Gameplay",
            "description": "",
            "link": "img/portfolio/tower/gameplay2.png"
          }
        ],
        "videos": [
          "https://www.youtube.com/embed/rFqSklQ--tM"
        ]
      }
    },
    {
      "name": "Sprawl Celerity",
      "summary": "Sprawl Celerity is a futuristic 3D Battle-Racing video game with fast cars, powerful weapons and tracks in different scenarios, designed for PC with support for local and networked play.",
      "date": "July 2016",
      "localPage": "sprawl",
      "externalPage": "",
      "platforms": [
        {
          "name": "Windows",
          "link": ""
        }
      ],
      "icon": "img/portfolio/sprawl.png",
      "image": "img/portfolio/sprawl.png",

      "description": [
        "Sprawl Celerity have a focus on speed, the idea is to make players feel they are driving a fast race car, and not a killing machine. But we want to provoke that nervous feeling on the players, especially the ones leading, since they are more propitious to being hit by weapons, this make the win feel much more rewarding. While weapons are an important part of the game, they are not required to succeed."
      ],
      "details": {
        "genres": [ "Race" ],
        "localPlayerTotal": 1,
        "onlinePlayerTotal": 8,
        "lastUpdated": "14-Jul-2016"
      },
      "production": {
        "motivation": "My personal motivation is from an old game named Dethkarz. I've played a lot in my childhood and I never found something like that. When I've discovered it would must create a large game project in the end of the game development course, I decided to create a game like Dethkarz. Plauto accepted my invite to do this project with me. He is a programmer, so we two didn't have an artist to create models. Because of that, I got the art part and it was a good challenge for me.",
        "remarks": [
          "Custom tools to create tracks faster;",
          "Unet (Unity Network);",
          "Lighting and occlusion maps;",
          "Some 3D objects created or adapted by me;",
          "Personal Framework;",
          "Demo mode;"
        ],
        "history": [
          {
            "name": "0.0.1 – Prototype",
            "date": "11-Feb-2016",
            "objective": "Test main features and see how it works."
          },
          {
            "name": "0.0.2 – Race mode",
            "date": "30-Apr-2016",
            "objective": "Race mode improved and AI cars added."
          },
          {
            "name": "0.0.3 – GDD",
            "date": "05-May-2016",
            "objective": "Game design document created with art mocks."
          },
          {
            "name": "0.0.4 – Vertical Slice",
            "date": "10-Jun-2016",
            "objective": "Game with all main features working."
          },
          {
            "name": "0.1.0 – Beta",
            "date": "14-Jul-2016",
            "objective": "Game experience finalized."
          },
          {
            "name": "0.1.1 – Sounds",
            "date": "09-Ago-2016",
            "objective": "Soundtracks and more sound effects added."
          }
        ]
      },
      "media": {
        "screenshots": [
          {
            "title": "Main menu",
            "description": "",
            "link": "img/portfolio/sprawl/menus.png"
          },
          {
            "title": "Nalpure track",
            "description": "",
            "link": "img/portfolio/sprawl/nalpure16x9.png"
          },
          {
            "title": "Rooteran",
            "description": "",
            "link": "img/portfolio/sprawl/rooteran16x9.png"
          },
          {
            "title": "Track model",
            "description": "",
            "link": "img/portfolio/sprawl/bezier.png"
          },
          {
            "title": "Photo",
            "description": "",
            "link": "img/portfolio/sprawl/monitor-photo.jpg"
          }
        ],
        "videos": [ "https://www.youtube.com/embed/iRgab48-QGU" ]
      }
    },
    {
      "name": "Jump 'n Bump",
      "summary": "Jump 'n Bump is a deathmatch competition among rabbits. The player must step over other rabbit to kill it. The rabbit whose kill the most wins!",
      "date": "April 2015",
      "localPage": "jump",
      "externalPage": "",
      "platforms": [
        {
          "name": "Android",
          "link": "https://drive.google.com/open?id=0BywrL8k68fEPX2F0WjVWV1QxaUE"
        },
        {
          "name": "Windows",
          "link": "https://drive.google.com/open?id=0BywrL8k68fEPbVR4bzdFajc1djA"
        }
      ],
      "icon": "img/portfolio/jump.png",
      "image": "img/portfolio/jump.png",
      "description": [
        "Jump ‘n Bump is a remake of a demo created in 1998 by Brainchild Design. Its code was released as public domain in 1999. I recreated the game logic and physics, without the original code, in Unity. I used the original sprites and audios.",
        "The game’s theme is a deathmatch competition among rabbits. The player controls one rabbits and must step over other rabbit to kill it. The only controls are horizontal move and jump. There is no time up or max point, the players decides to end.",
        "\"I improved this game adding more features. I created an IA to control a rabbit if the player set it. It allows single player game which wasn't possible in original version. Screens were added to configure match and game options, also splash screens were added.",
        "\"Online and portability were implemented. Playing in online mode is possible and compatible with others platforms (ex: pc x android). Those feature wasn't present in original game too."
      ],
      "details": {
        "genres": [ "Party", "Versus" ],
        "localPlayerTotal": 4,
        "onlinePlayerTotal": 4,
        "lastUpdated": "10-Apr-2015"
      },
      "production": {
        "motivation": "My cousins introduced me to this demo game when I was young. We played it a lot even with only one level available. That was fun. When I got knowledge enough to create games by myself, I decided to start doing a remake of this game. Jump ‘n Bump has a simplicity that I needed to begin make games. Some weeks after, I played my remake with my mother and my sisters and we had the same fun as I had playing the original in the pass.",
        "history": [
          {
            "name": "0.0.1 – Prototype",
            "date": "02-Dec-2014",
            "objective": "Recreate the same level of the original game with four players playable."
          },
          {
            "name": "0.0.2 – Alpha Improvements",
            "date": "20-Dec-2014",
            "objective": "Temporary UI and resolution stabilization. Bugs fixed and gameplay improved."
          },
          {
            "name": "0.0.3 – Alpha Layout",
            "date": "01-Jan-2015",
            "objective": "UI remodeled. Interfaced responds standards resolutions and aspect ratios."
          },
          {
            "name": "0.0.4 – Alpha Online",
            "date": "17-Jan-2015",
            "objective": "Online match feature added."
          },
          {
            "name": "0.0.5 – Alpha Android",
            "date": "04-Mar-2015",
            "objective": "Android compatibility added. English and Portuguese can be selected now."
          },
          {
            "name": "0.1.0 – Beta IA",
            "date": "10-Mar-2015",
            "objective": "AI (Artificial Intelligence) available to control rabbits to play against human players."
          },
          {
            "name": "1.0.0 – Release",
            "date": "24-Ago-2015",
            "objective": "Pathfinding updated. Android controls defined to IA for other players."
          }
        ]
      },
      "media": {
        "screenshots": [
          {
            "title": "Menus",
            "description": "Defines what rabbits are going to play.",
            "link": "img/screenshots/jump1.png"
          },
          {
            "title": "Stage",
            "description": "Original game stage.",
            "link": "img/screenshots/jump2.png"
          }
        ],
        "videos": [
          "https://www.youtube.com/embed/w2jwDkmjmhc"
        ]
      }
    },
    {
      "name": "Galaga",
      "summary": "Galaga is a classic arcade game. I've recreated it using Monogame for 2D Programming class work.",
      "date": "June 2015",
      "localPage": "galaga",
      "externalPage": "",
      "platforms": [
        {
          "name": "Windows",
          "link": ""
        }
      ],
      "icon": "img/portfolio/galaga.png",
      "image": "img/portfolio/galaga.png",

      "description": [
        "Galaga is a space shooter game that was very popular in arcades. The player controls a space chip that must destroy all aliens which appear in its view. Enemies will shot back, dive in your direction and try to abduct the player's chip. Every wave defeated will increase the difficulty.",
        "For the future, I will implement the rest of the basic Galaga features, as rescuing a captured galaga ship. I've already done the two Galagas together, but transport the ship behind the boss is another difficult challenge.",
        "This game has a lot of versions. This remake is focus on Galaga 1981 for arcades."
      ],
      "details": {
        "genres": [ "Arcade", "Shot'em up" ],
        "localPlayerTotal": 1,
        "onlinePlayerTotal": 0,
        "lastUpdated": "16-Ago-2016"
      },
      "production": {
        "motivation": "My Professor has given me a lesson to remake an arcade game using Monogame (open source version o XNA). Galaga has some easy and hard issues. One of the easy was the fact that I have a few physics collisions and constraints. One of the hard one to me (and for everybody in the class that chose Galaga) was to create and manage the formations. It needed a lot of math formulas!",
        "history": [
          {
            "name": "0.0.1 – Prototype",
            "date": "5-May-2015",
            "objective": "Prototypes for multiple functionalities in separate. Monogame engine adaptation."
          },
          {
            "name": "0.0.2 – Union",
            "date": "16-Jun-2015",
            "objective": "Add all prototypes in the same project and test. Add more functionalities."
          },
          {
            "name": "0.0.3 – Presentation",
            "date": "28-Jun-2015",
            "objective": "Remove some bugs and create menu with videos to give the idea."
          }
        ]
      },
      "media": {
        "screenshots": [
          {
            "title": "",
            "description": "",
            "link": "img/portfolio/galaga/gameplay.png"
          }
        ],
        "videos": [ "https://www.youtube.com/embed/87MYN2sWios" ]
      }
    },
    {
      "name": "Drawing Cube",
      "summary": "This game is an auxiliary toy game. The toy allows kids to draw on all cubes faces where each face has an animal borders drawn. With this game, the kids can import theirs draws by taking photos. For every face (will be) an unique game using a sprite cut from the photo put in the correspondent face. It allows them to play games with theirs draw.",
      "date": "Dec 2015",
      "localPage": "cube",
      "externalPage": "",
      "platforms": [
        {
          "name": "Android",
          "link": "https://drive.google.com/open?id=0BywrL8k68fEPcFZCZi1rUHF3M0U"
        },
        {
          "name": "Windows",
          "link": "https://drive.google.com/open?id=0BywrL8k68fEPOVlZZnZxZTBNUVE"
        }
      ],
      "icon": "img/portfolio/cube.png",
      "image": "img/portfolio/cube.png",

      "description": [
        "This game is an auxiliary software. A toy called Cubo de Desenhar (Drawing Cube, in English) is a product of a LudYx store. Me and Natanael Rey (responsible to Game Design and Art).",
        "The toy allows kids to draw on all cubes faces. Each faces has an animal borders drawn. With this game, the kids can import theirs draws by taking photos. For every face (will be) a unique game using a sprite cut from the photo put in the correspondent face. It allows them to play games with theirs draw.",
        "Others minigames will be produce when the client contact us again."
      ],
      "details": {
        "genres": [ "Kids", "Toy software", "Mobile" ],
        "localPlayerTotal": 1,
        "onlinePlayerTotal": 0,
        "lastUpdated": "14-Dec-2015"
      },
      "production": {
        "motivation": "LudYx store contacted Natanael to tell about the project. He accepted and asked me to join. So we created this prototype.",
        "history": [
          {
            "name": "0.0.1 – Prototype",
            "date": "14-Ago-2015",
            "objective": "Definitions of how the game should be. Testing all main features after adding more."
          }
        ]
      },
      "media": {
        "screenshots": [
          "img/screenshots/cube1.png",
          "img/screenshots/cube2.png"
        ],
        "videos": []
      }
    },
    {
      "name": "Project Boosters",
      "summary": "It isn't a game yet. It is just a concept right now. I have some ideas but I'm busy with other projects. Probably it will be an adventure with fire powers with puzzles and bosses to defeat. Would you like it?",
      "date": "",
      "localPage": "boosters",
      "externalPage": "",
      "platforms": [
        {
          "name": "Windows",
          "link": "https://drive.google.com/file/d/0BywrL8k68fEPcW51YlBlQU1NRHc/view"
        }
      ],
      "icon": "img/portfolio/boosters.png",
      "image": "img/portfolio/boosters.png",

      "description": [
        "This is a concept of a future game. Me and Natanael Rey, who is a 3D artist and my classmate in Game specialization, started this project. We have some features in mind that will soon be added in project."
      ],
      "details": {
        "genres": [ "Plataform", "Adventure" ],
        "localPlayerTotal": 1,
        "onlinePlayerTotal": 0,
        "lastUpdated": "14-Apr-2015"
      },
      "production": {
        "motivation": "Me and Natanael wanted to create a good gameplay of a character that flies like Iron-man does.",
        "history": [
          {
            "name": "0.0.1 – Prototype",
            "date": "14-Ago-2015",
            "objective": "Definitions of how the game should be. Testing all main features after adding more."
          }
        ]
      },
      "media": {
        "screenshots": [
          {
            "title": "",
            "description": "",
            "link": "img/portfolio/boosters/gameplay.jpg"
          }
        ],
        "videos": [
          "https://www.youtube.com/embed/uxoW6VE1Oak"
        ]
      }
    }
  ],
  "otherGames": [
    {
      "name": "Bomberman 3D",
      "summary": "Bomberman 3D is a game based on the classic Bomberman games. The difference it is a 3D game in first person. It features campaign mode, battle local and battle online.",
      "date": "Dec 2015",
      "localPage": "",
      "externalPage": "",
      "platforms": [
        {
          "name": "Windows",
          "link": ""
        }
      ],
      "icon": "img/portfolio/bomber.jpg",
      "image": "img/portfolio/bomber.jpg"
    },
    {
      "name": "Strategy Warriors",
      "summary": "Strategy Warriors is a pseudo turn-based game in progress. It’s genre is artillery with a mechanics which requires each team sets movements to all it’s pieces.",
      "date": "May 2015",
      "localPage": "",
      "externalPage": "",
      "platforms": [
        {
          "name": "Windows",
          "link": ""
        }
      ],
      "icon": "img/portfolio/warriors.png",
      "image": "img/portfolio/warriors.png"
    }
  ]
}
